# Case Study on Testing of Hypothesis
## A company started to invest in digital marketing as a new way of their product promotions.For that they collected data and decided to carry out a study on it.
   ### ‚óè The company wishes to clarify whether there is any increase in sales after stepping into digital marketing.
   ###  ‚óè The company needs to check whether there is any dependency between the features ‚ÄúRegion‚Äù and ‚ÄúManager‚Äù.
#### Help the company to carry out their study with the help of data provided.

In [144]:
#importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
from scipy.stats import chi2_contingency

In [145]:
df=pd.read_csv('Sales_add.csv')

In [146]:
df.head()

,Month,Region,Manager,Sales_before_digital_add(in $),Sales_After_digital_add(in $)
0,Month-1,Region - A,Manager - A,132921,270390
1,Month-2,Region - A,Manager - C,149559,223334
2,Month-3,Region - B,Manager - A,146278,244243
3,Month-4,Region - B,Manager - B,152167,231808
4,Month-5,Region - C,Manager - B,159525,258402

In [147]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Month                           22 non-null     object
 1   Region                          22 non-null     object
 2   Manager                         22 non-null     object
 3   Sales_before_digital_add(in $)  22 non-null     int64
 4   Sales_After_digital_add(in $)   22 non-null     int64
dtypes: int64(2), object(3)
memory usage: 1008.0+ bytes

# 1.Descriptive analysis on the dataset.

In [148]:
df.describe()

       Sales_before_digital_add(in $)  Sales_After_digital_add(in $)
count                       22.000000                      22.000000
mean                    149239.954545                  231123.727273
std                      14844.042921                   25556.777061
min                     130263.000000                  187305.000000
25%                     138087.750000                  214960.750000
50%                     147444.000000                  229986.500000
75%                     157627.500000                  250909.000000
max                     178939.000000                  276279.000000

## Insights:
    1.The given dataset contains 22 rows and 4 columns.
    2.This dataset is not containing any null values.
    3The average sales before digital marketing add is 149239.95 and average sales after digital add is 231123.73.

#  ‚óèThe company wishes to clarify whether there is any increase in sales after stepping into digital marketing.
## One tailed Paired Samples T-Test.
## Hypothesis:
*  **Ho**:The sales before and after stepping into digital marketing are same
*  **Ha**:The sales after stepping into digital marketing is more.
*  $\alpha $: 0.05

In [169]:
sales_BDM=df['Sales_before_digital_add(in $)']
sales_ADM=df['Sales_After_digital_add(in $)']

In [173]:
tvalue, pvalue=stats.ttest_rel(sales_ADM,sales_BDM,alternative='greater')
print("The t value of means is: ", round(tvalue, 4))
print("The p value based on the t score is: ", round(pvalue,4))

The t value of means is:  12.0907
The p value based on the t score is:  0.0

In [172]:
stats.ttest_rel(sales_ADM,sales_BDM,alternative='greater')

Ttest_relResult(statistic=12.09070525287017, pvalue=3.168333502287889e-11)

## From above T test,  0 is the p-value, 12.0907 is the statistical value.
## As the p-value=0.0< $\alpha$=0.05 and hence we reject the null Hypothesis
## ie. The sales after stepping into digital marketing is more.

# ‚óèThe company needs to check whether there is any dependency between the features ‚ÄúRegion‚Äù and ‚ÄúManager‚Äù.
## Chi Square test for Dependency
## Hypothesis:
*  **Ho** :The 2 features ‚ÄúRegion‚Äù and ‚ÄúManager‚Äù which are to be compared are independent.
*  **Ha** :The 2 features are dependent.
*  $\alpha$ : 0.05

In [175]:
df3=pd.crosstab(df.Region, df.Manager, margins=True)
df3

Manager     Manager - A  Manager - B  Manager - C  All
Region
Region - A            4            3            3   10
Region - B            4            1            2    7
Region - C            1            3            1    5
All                   9            7            6   22

In [176]:
value = np.array([df3.iloc[0][0:3].values,
                  df3.iloc[1][0:3].values,
                  df3.iloc[2][0:3].values])
stat, p, dof, expected=chi2_contingency(value)

In [177]:
print(chi2_contingency(value)[0:3])
alpha = 0.05
print("p value is " + str(p))
if p <= alpha:
    print('Dependent (reject H0)')
else:
    print('Independent (H0 holds true)')

(3.050566893424036, 0.5493991051158094, 4)
p value is 0.5493991051158094
Independent (H0 holds true)

# From above CHI SQUARE Test,  0.5494 is the p-value, 3.0506 is the statistical valueand 4 is the degree of freedom. 
## As the p-value=0.5494>  ùõº =0.05 and hence we ACCEPT the NULL Hypothesis.
## Ie. The 2 features ‚ÄúRegion‚Äù and ‚ÄúManager‚Äù which are to be compared are Independent.